In [4]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv(
    r"C:\Users\manvendra.bhadau\Documents\MLApps Training\data\Input_Sales_Data_v2.csv"
)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1080339 entries, 0 to 1080338
Data columns (total 9 columns):
 #   Column        Non-Null Count    Dtype
---  ------        --------------    -----
 0   Id            1080339 non-null  int64
 1   Date          1080339 non-null  object
 2   Manufacturer  1080339 non-null  object
 3   Category      1080339 non-null  object
 4   Brand         1080339 non-null  object
 5   SKU Name      1080339 non-null  object
 6   Volume        1080339 non-null  float64
 7   Value         1080339 non-null  float64
 8   Price         790235 non-null   float64
dtypes: float64(3), int64(1), object(5)
memory usage: 74.2+ MB

In [7]:
df.head()

,Id,Date,Manufacturer,Category,Brand,SKU Name,Volume,Value,Price
0,0,2022-06-18,Manufacturer_59,Category_0,Brand_241,SKU Name_520,10.0,270.0,27.000000
1,1,2021-06-19,Manufacturer_59,Category_0,Brand_241,SKU Name_520,0.0,40.0,NaN
2,3,2022-11-19,Manufacturer_59,Category_0,Brand_241,SKU Name_520,10470.0,242390.0,23.150907
3,5,2021-12-18,Manufacturer_59,Category_0,Brand_241,SKU Name_520,5620.0,105190.0,18.717082
4,7,2022-12-17,Manufacturer_59,Category_0,Brand_241,SKU Name_520,30.0,350.0,11.666667

In [8]:
df.loc[df["Price"].isnull()].shape

(290104, 9)

In [9]:
df.loc[df["Volume"] == 0].shape

(290104, 9)

In [10]:
df = df.dropna(subset=["Price"])

In [11]:
df

,Id,Date,Manufacturer,Category,Brand,SKU Name,Volume,Value,Price
0,0,2022-06-18,Manufacturer_59,Category_0,Brand_241,SKU Name_520,10.0,270.0,27.000000
2,3,2022-11-19,Manufacturer_59,Category_0,Brand_241,SKU Name_520,10470.0,242390.0,23.150907
3,5,2021-12-18,Manufacturer_59,Category_0,Brand_241,SKU Name_520,5620.0,105190.0,18.717082
4,7,2022-12-17,Manufacturer_59,Category_0,Brand_241,SKU Name_520,30.0,350.0,11.666667
5,8,2022-04-30,Manufacturer_59,Category_0,Brand_241,SKU Name_520,600.0,8420.0,14.033333
...,...,...,...,...,...,...,...,...,...
1080330,3351886,2022-11-05,Manufacturer_96,Category_1,Brand_115,SKU Name_5974,10.0,820.0,82.000000
1080331,3351887,2022-11-12,Manufacturer_96,Category_1,Brand_115,SKU Name_5974,10.0,380.0,38.000000
1080333,3351889,2022-11-26,Manufacturer_96,Category_1,Brand_115,SKU Name_5974,10.0,340.0,34.000000
1080334,3351890,2022-12-03,Manufacturer_96,Category_1,Brand_115,SKU Name_5974,10.0,300.0,30.000000
1080337,3351893,2022-12-24,Manufacturer_96,Category_1,Brand_115,SKU Name_5974,10.0,750.0,75.000000

In [12]:
df.loc[df["Price"].isnull()].shape

(0, 9)

In [13]:
df.loc[df["Volume"] == 0].shape

(0, 9)

In [14]:
df["Date"] = pd.to_datetime(df["Date"])

In [15]:
df.describe()

,Id,Date,Volume,Value,Price
count,7.902350e+05,790235,7.902350e+05,7.902350e+05,7.902350e+05
mean,1.650888e+06,2021-12-29 12:48:54.922396160,7.592682e+09,6.327276e+09,1.322967e+08
min,0.000000e+00,2021-01-02 00:00:00,1.000000e+01,0.000000e+00,0.000000e+00
25%,7.895735e+05,2021-06-26 00:00:00,2.000000e+01,5.300000e+02,9.667870e+00
50%,1.636634e+06,2022-01-01 00:00:00,1.200000e+02,2.120000e+03,1.766667e+01
75%,2.469768e+06,2022-06-25 00:00:00,9.600000e+02,1.404000e+04,3.016667e+01
max,3.351893e+06,2022-12-31 00:00:00,1.000000e+15,1.000000e+15,1.000000e+14
std,9.790478e+05,NaN,2.755473e+12,2.515393e+12,1.126082e+11